* Intro
I want to put together a complete 6502 environment in elisp.

Features:
- simulate multiple systems concurrently
- simulate common 65-series hardware environments and chips
- assemble source code into ROMs and other images
- emulate 6502, 6522, etc to run and debug code

Simulation goals:
- Two 6502s communicating via a serial interface (6522?)
- A group of 6502s communicating via packet radio

Interesting chips:
- 6522 VIA 2 port parellel and 2-timer
- 6552 RIOT (RAM I/O Timer) w/128 bytes RAM as found on 2600
- 6264 SRAM http://www.cs.uml.edu/~fredm/courses/91.305/files/cy6264.pdf
* Components
** Bus
The bus hosts a set of devices mediated by device managers that take
the place of address decoders, CS logic, etc.

Devices can emit and receive read requests, write requests and signals via the bus.  Reads and writes have a 16-bit address, signals have only a truth value in the form of their presence or absence.

There is no use case for clock cycle emulation yet but I believe it might become relevant as more emulated hardware is written.
** Devices
*** 6264 SRAM
*** file-backed ROM
** Emulator
6502 to be provided by emacs-nes
Bus emulation and 65xx series chip emulators to be written
** Assembler
To be provided by or modelled after COMFY-65 or cl-comfy-6502
** Disassembler
To be written

Decompile to COMFY-65?  maybe not possible.  In that case, the assembler can't really be COMFY-65 either, we need another one to do round trip from the disassembler to editor to assembler to code back to disassembler.

cl-comfy-6502 compiles to a parsed assembly format, for example:
#+BEGIN_EXAMPLE
  (compile-code (3 (1+ 100)))
    -->
  ((INC :ZERO-PAGE) (:ZERO-PAGE 100) 
   (INC :ZERO-PAGE) (:ZERO-PAGE 100) 
   (INC :ZERO-PAGE) (:ZERO-PAGE 100))
#+END_EXAMPLE
..which could totally be used as the dissassembly format.

COMFY-65 just outputs the raw code:
#+BEGIN_SRC elisp
  (comfy-init)
  (seq-subseq comfy-mem (comfy-compile '(3 (1+ 100)) #x0680 nil))
#+END_SRC

#+RESULTS:
: [230 100 230 100 230 100 76 128 6]

I guess maybe I could port cl-comfy-6502 *back* to elisp.  It has the same license as COMFY-65 though.  Not that I aspire to have commercial applications, but there are licensing requirements I don't want to deal with just for redistribution.
** Monitor/debugger
To be written
* References
- https://github.com/gongo/emacs-nes includes a 6502 emulator!
- https://www.atarimax.com/jindroush.atari.org/achip.html chips in the Atari
- http://archive.6502.org/datasheets/mos_6522_preliminary_nov_1977.pdf 6522
* emacs-nes
Just to demonstrate that the 6502 emulator works
#+BEGIN_SRC sh
  hg clone git+https://github.com/gongo/emacs-nes
#+END_SRC
#+BEGIN_SRC elisp :results silent
  (add-to-list 'load-path (concat default-directory "emacs-nes"))
  (load "nes.el")
  "Loaded emacs-nes"
#+END_SRC
Tetris sourced from http://www.nesfiles.com/NES/Tetris/Tetris.nes
#+BEGIN_SRC elisp :results silent
  (nes "Tetris.nes")
#+END_SRC
* Scratch
#+BEGIN_SRC elisp
  ;; SRAM that appears twice
  (defun e65-example-mapper (device addr)
    ;; Ignore the 10th bit causing this chip to be mapped to
    ;; 0x0000-0x1ffff and again to 0x2000-0x3ffff
    (let ((addr (logand addr (lognot #x2000))))
      ;; If modified addr is in lower 8K, use it.  otherwise return nil
      ;; to prevent the call to read/write on the device
      (and ((< addr #x2000) addr))))

  ;; Each cycle, write to the bus; everything else will get their
  ;; e65-device-write-function called
  (defun e65-example-signal (device signals)
    (and (member :phi2 signals)
         (e65-device-write device #xabcd #xef)))
#+END_SRC
* COMMENT Config
# Local Variables:
# truncate-lines: nil
# word-wrap: t
# indent-tabs-mode: nil
# End:
